[
	"HTML is the standard markup language used for creating the structure and content of web pages. It provides a set of predefined tags that define the elements of a web page, such as headings, paragraphs, images, links, tables, forms, and more. CSS is a style sheet language used for describing the presentation and appearance of a document written in HTML or XML. It allows you to define the layout, colors, fonts, spacing, and other visual aspects of a web page. JavaScript is a high-level programming language that adds interactivity and dynamic behavior to web pages. It allows you to create scripts that can be executed by web browsers, enabling tasks such as validating user input, manipulating web page content, responding to events (e.g., button clicks), making AJAX requests to the server, and much more. In summary, HTML is used for structuring the content, CSS is used for styling and layout, and JavaScript is used for adding interactivity and functionality to web pages.",
	"Git is a distributed version control system (VCS) that allows developers to track changes in their source code during the development process. Git provides features like committing changes, creating branches, merging branches, and reverting to previous versions. Developers can work on their code offline and synchronize changes with other repositories later. GitHub is a web-based hosting service that provides a platform for collaboration and sharing of Git repositories. GitHub allows multiple developers to work on the same project simultaneously and facilitates collaboration through features like pull requests and discussions.",
	"jQuery and React are both JavaScript libraries used for front-end development, but they serve different purposes and have distinct approaches. jQuery is a fast and lightweight JavaScript library designed primarily to simplify DOM manipulation and provide a simple way to handle events, create animations, and perform AJAX requests. Developers can directly select elements using CSS-style selectors and apply actions to them, like showing/hiding elements, changing their content, or applying CSS styles. React is a JavaScript library developed by Facebook in 2013. It is focused on building user interfaces, specifically for creating reusable UI components. React follows a component-based architecture, where developers can build complex UIs by breaking them down into smaller, manageable pieces called components. React uses a virtual DOM to efficiently update and render UI components, making it more suitable for building modern, interactive web applications.",
	"Front-end developers are responsible for creating the user interface and user experience of a website or web application. Their main focus is on the parts of the website that users interact with directly. This includes the design, layout, and visual elements that users see and interact with in their web browsers. Back-end developers work on the server-side of web development, dealing with the behind-the-scenes functionality that powers the website or web application. They are responsible for handling data storage, processing, and server-side logic that makes the website function properly.",
	"Absolute, root-relative, and document-relative are terms used to describe different types of paths or links in web development. They define how a link points to a resource (such as a webpage, image, or file) on the internet or within a website. An absolute link contains the full URL, including the protocol, domain name, and path to the resource. Absolute links provide the complete address of the resource on the web. They are typically used when you want to link to an external resource or when you need to ensure a direct link to a specific location on the web. A root-relative link specifies the path to a resource from the root directory of the website. It starts with a forward slash and then provides the path to the resource from the root of the domain. A document-relative link specifies the path to a resource based on the location of the current document (webpage). It doesn't include the domain or protocol information. Document-relative links are used to reference resources within the same website or domain, relative to the current page's location.",
	"JPEG (Joint Photographic Experts Group) is a lossy compression format, meaning it reduces the file size by discarding some image data. This can lead to a slight loss of quality. It does not support transparency. Backgrounds are typically solid colors. GIF (Graphics Interchange Format) is a lossless compression format, which means it retains all image data and quality. It's limited to 256 colors (8-bit), making it suitable for simple images with fewer colors. It supports transparent backgrounds, allowing images to have non-rectangular shapes or appear on different backgrounds. GIFs can also support animation by displaying a sequence of images in a loop. PNG (Portable Network Graphics) is a lossless compression format, preserving image quality without loss of data. It supports a wide range of colors and is well-suited for images with transparency and complex details. SVG (Scalable Vector Graphics) is not a raster image format like the others; it's a vector format that uses mathematical equations to define shapes, curves, and lines. SVG images are resolution-independent and can be scaled to any size without losing quality. It supports a wide range of colors and gradients and can include interactive elements like hyperlinks and animations.",
	"The Product Owner is a key role in Agile methodologies, particularly in Scrum. This individual represents the stakeholders, customers, and users, and ensures that the development team is working on the most valuable features and that the product meets the needs of the users. The Product Manager is responsible for the overall product strategy and vision. They work closely with the Product Owner to define high-level goals, identify market opportunities, and prioritize features. The Business Analyst is responsible for understanding the business needs and translating them into detailed requirements that the development team can implement. The Scrum Master is a facilitator and servant leader for the Scrum team. They help the team understand and adopt Scrum practices, remove obstacles that hinder progress, and facilitate communication and collaboration. The User Experience (UX) Designer focuses on creating a positive and meaningful experience for users interacting with the product. They design the user interface, consider usability, and conduct user research to ensure that the product is intuitive, user-friendly, and meets the needs of the target audience. Developers or Engineers are responsible for writing code and implementing the features and functionalities defined in the product backlog. QA (Quality Assurance) or SDET (Software Development Engineer in Test) professionals are responsible for ensuring the quality of the software through testing. DevOps professionals aim to streamline the software development lifecycle by automating processes, improving deployment speed, and ensuring continuous integration and delivery."
]